erpdev.СХК_Расширение/src/Catalogs/Партнеры/Партнеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Партнеры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes extendedConfigurationObject="b0ad52da-9947-47a8-a68b-11851a131b26">
    <name>Перевозчик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1ccf79bb-a7d7-4c19-80ad-eb0164f60ec4">
    <name>ДатаРегистрации</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="2e4e19e3-f318-469a-8bd1-9678b54892a1">
    <name>Клиент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d3e6f413-7dd9-4368-a09f-533e03e04f62">
    <name>ЮрФизЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="39fd6f5e-b33c-449b-a232-ce54d30e9226">
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="0bc19715-bd85-4a2a-a978-9d1f5f4ca433">
    <name>Поставщик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6f1e7f04-dd0e-4f17-8e24-6d8b970d4131">
    <name>ВидЦен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4f7c1204-9add-4378-a8fd-1b5660f4b41c">
    <name>Конкурент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3f087e87-8483-43c5-9111-4da46485b329">
    <name>ПрочиеОтношения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4c2fd28b-f481-46c0-947c-de5678b60a49">
    <name>ОбслуживаетсяТорговымиПредставителями</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c7ea8ef0-0b93-43d1-a069-5960fcb7104e">
    <name>ДатаРождения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="4f2b4a8d-617d-4e3e-aef8-e41fb3279e0a">
    <name>Пол</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6934c1c6-ad33-4301-b7a7-24c669207013">
    <name>ОсновнойМенеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="da2b726f-ca42-4800-a7aa-b6b1730605dd">
    <name>ШаблонЭтикетки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b89dd990-749c-47c1-b47b-6bfb305026cc">
    <name>ГруппаДоступа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="180d58cf-821b-4bd1-b7c5-c5987430c9e6">
    <name>ДополнительнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="48bbc10f-4534-415b-a119-51ba94760f05">
    <name>БизнесРегион</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2420efea-cafc-4d98-8dad-a14d7e4c443d">
    <name>ЗонаДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5cea7e64-74c0-4f6b-ac26-39632f377044">
    <name>ВариантОтправкиЭлектронногоЧека</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e2a0fa6b-78ae-4dd9-b6c4-06c9ae9cf28f">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Расш1_ДоговорИП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Расш1_ДатаНачалаДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расш1_ДатаОкончанияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расш1_Подразделение</name>
    <type>
      <types>CatalogRef.Расш1_ПодразделенияСотрудниковИП</types>
    </type>
  </attributes>
  <attributes>
    <name>Расш1_Должность</name>
    <type>
      <types>CatalogRef.Расш1_Должность</types>
    </type>
  </attributes>
  <attributes>
    <name>Расш1_Оплата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расш1_КонтактныеДанные</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расш1_Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections extendedConfigurationObject="0daacbf9-aa02-4485-a535-d2d28b00523c">
    <name>КонтактнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="3b79728c-4ce5-4330-b398-b32f0bb3e6d5">
      <name>Представление</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>500</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="675d6c69-31a6-49c2-a9b2-cc82f578bbeb">
      <name>НомерТелефона</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>20</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="b9e943c2-8fad-47c5-b878-66f2576cc609">
      <name>ЗначенияПолей</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="6203050a-d3b4-4e82-89f7-5ad54cf4906b">
      <name>Вид</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

erpdev.СХК_Расширение/src/Catalogs/Партнеры/Forms/ФормаЭлемента/Module.bsl
///////////////////////
//////Ткачева Е.В. 19.09.2024   
&НаКлиенте
Процедура Расш1_ПриОткрытииПеред(Отказ)
 Если ЭтаФорма.Объект.Расш1_ДоговорИП = Истина Тогда 
		Элементы.Расш1_ДатаНачалаДоговора.Видимость = Истина;
		Элементы.Расш1_ДатаОкончанияДоговора.Видимость = Истина; 
		Элементы.Расш1_Подразделение.Видимость = Истина;  
		Элементы.Расш1_Должность.Видимость = Истина;   
		Элементы.Расш1_Оплата.Видимость = Истина;
	ИначеЕсли  
		ЭтаФорма.Объект.Расш1_ДоговорИП = Ложь Тогда 
		Элементы.Расш1_ДатаНачалаДоговора.Видимость = Ложь; 
		Элементы.Расш1_ДатаОкончанияДоговора.Видимость = Ложь; 
		Элементы.Расш1_Подразделение.Видимость = Ложь;  
		Элементы.Расш1_Должность.Видимость = Ложь;   
		Элементы.Расш1_Оплата.Видимость = Ложь;
КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура Расш1_Расш1_ДоговорИППриИзмененииПосле(Элемент)
	Если ЭтаФорма.Объект.Расш1_ДоговорИП = Истина Тогда 
		Элементы.Расш1_ДатаНачалаДоговора.Видимость = Истина;
		Элементы.Расш1_ДатаОкончанияДоговора.Видимость = Истина; 
		Элементы.Расш1_Подразделение.Видимость = Истина;  
		Элементы.Расш1_Должность.Видимость = Истина;   
		Элементы.Расш1_Оплата.Видимость = Истина;  
		Элементы.Расш1_Адрес.Видимость = Истина;
		Элементы.Расш1_КонтактныеДанные.Видимость = Истина;
	ИначеЕсли  
		ЭтаФорма.Объект.Расш1_ДоговорИП = Ложь Тогда 
		Элементы.Расш1_ДатаНачалаДоговора.Видимость = Ложь;
		Элементы.Расш1_ДатаОкончанияДоговора.Видимость = Ложь; 
		Элементы.Расш1_Подразделение.Видимость = Ложь;  
		Элементы.Расш1_Должность.Видимость = Ложь;   
		Элементы.Расш1_Оплата.Видимость = Ложь;  
		Элементы.Расш1_Адрес.Видимость = Ложь;
		Элементы.Расш1_КонтактныеДанные.Видимость = Ложь;
		КонецЕсли;
	    КонецПроцедуры



	
//////////////
